nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
										 VocREC.Sate=VOICEREC_DataRXing;
										 VocREC.ExcuteFlag=1;  
							            }								   
								  break;
    	    case  VOICEREC_IDLE:
	   	                                            break;
											 
	   

      	} 
  }
}

void VOC_REC_FileEndProcess(void)
{
     u16  namelen=0,i;	
     u8    pic_buf[50]; 
	
    		 {    //   最后一包
                       //--------------------------
                       VocREC.curren_PageCNT=SoundStart_offdet;
			  memset(pic_buf,0,sizeof(pic_buf)); 
                       memcpy(pic_buf,(u8*)&VocREC.file_write,4);	  // filesize  
                       namelen=strlen((const char*)VocREC.file_name); // get filename len
			  memcpy(pic_buf+4,VocREC.file_name,namelen);			  
			  DF_WriteFlashDirect(SoundStart_offdet,0,pic_buf, 25);   //  4+20  1 (null)
			  DF_delay_ms(10); 			   
                      //--------------------------------------------------------------------------                  
	               rt_kprintf("\r\n        VoiceFileSize: %d Bytes\r\n   \r\n",VocREC.file_write); 
                      //-------------------------------------------------------------------------- 
                      VocREC.Sate=VOICEREC_IDLE;  
			 VocREC.file_write=0;   // clear  
                        DF_LOCK=disable; 

			
			 //   开始准备上传 录音
			 VocREC.rdytoTrans	=1;					 
			 //--------------------------------------------------------------------------
		  }
}

void VOC_REC_Stop(u8 *instr)     //  录音结束
{                                                           //%RECSTOP: 10,7000
    u16  i;	

               for(i=0;i<20;i++)   //  从前20个字节中找第一个,
		{
			if(instr[i]==',')
				break;
		} 
	      sscanf((const char*)instr+i+1, "%u", (u32*)&VocREC.filesize);

             // 1. 对比
	      rt_kprintf("\r\n   VoiceFile Size: %d    read =%d Bytes",VocREC.filesize,VocREC.file_write);
            //  2. end process
	      VOC_REC_FileEndProcess();

}
void VOC_REC_dataGet(u8 *instr )
{
    u16  i=0,commer=0;//,j=0;
    u16  namelen=0,len=0;	
    u8   pic_buf[550];  
	
   	if(VocREC.Sate==VOICEREC_DataRXing)  //%RECDATA:18,"0C49CA45E3F24DF500BE1
    	{
              for(i=0;i<20;i++)   //  从前20个字节中找第一个:
		{
		      if(instr[i]==':')
			  	commer=i;
			if(instr[i]=='"')
				break;
		} 
		 //  1. 获取长度	  
		  sscanf(instr+commer+1, "%d", (u32*)&len); 
		  rt_kprintf("\r\n  Rxlen=%d   RxinfoLen=%d bytes\r\n     ",len,len*28); //  
		  len=len*28;
                //  for(j=0;j<len;j++)
		  //          rt_kprintf("%c",instr[i+1+j]);   

		   // 2.  转换		
		   VocREC.HEX_len= GSM_AsciitoHEX_Convert(instr+i+1,len,VocREC.HEX); 	 
		   if(VocREC.HEX_len!=(len>>1))
		 	    rt_kprintf("\r\n   VocREC.HEX_len=%d  len=%d  voice  ASCII to HEX error!\r\n",VocREC.HEX_len,(len>>1));
                   
 
		    // 3.  write and  check
	                 DF_WriteFlashDirect( VocREC.curren_PageCNT,VocREC.file_write,VocREC.HEX, VocREC.HEX_len); 
                         //---  read compare 
			    memset(pic_buf,0,sizeof(pic_buf)); 
			    DF_ReadFlash(VocREC.curren_PageCNT,VocREC.file_write,pic_buf, VocREC.HEX_len);      
			    for(i=0;i<VocREC.HEX_len;i++)
			   {		if(pic_buf[i]!=VocREC.HEX[i])
			    	       {
			    	             rt_kprintf(" \r\n ----read not equal write  where i=%d  \r\n",i);  
						break;		 
			    	        }
			    }	    
                    // 4.  write update 
			  VocREC.file_write+=VocREC.HEX_len;	 //  add len
			   rt_kprintf(" \r\n VocREC.file_write=%d  \r\n",VocREC.file_write);      


		      //   5.  judge end
		        if(len<560)  //  可以认为是最后一包
		        {
		             	      VOC_REC_FileEndProcess();
		        }
		
    	} 
       else
	   	 rt_kprintf("\r\n Other VocREC.Sate=%d\r\n",VocREC.Sate);    


}


 void VOC_REC_Start(void)    // 录音开始
 { 
     if(GSM_PWR.GSM_power_over)     //  必须模块ON 起来才能操作
     {
             if(VocREC.running==0)      //  若正在处理中，不处理    
		{											   
			VocREC.running=1;  								
			VocREC.JT808_Duration=(UDP_HEX_Rx[14]<<8)+UDP_HEX_Rx[15];
			VocREC.JT808_SaveOrNot=UDP_HEX_Rx[16];
			VocREC.Sate=VOICEREC_RECORDING; 
			VocREC.ExcuteFlag=1;   
			VocREC.curren_PageCNT=SoundStart_offdet+1;  // clear    // 第一个page 留着最后写语音信息用，空着先
	              VocREC.rdytoTrans=0;  
			VocREC.file_write=0; 	  
		}
     	}			 
 }
FINSH_FUNCTION_EXPORT(VOC_REC_Start, voice recrod);
//=========================================================================
//    TTS  realated
u8    TTS_Get_Data(u8 *Instr,u16 LEN)     //  return   0   : OK     return   1 : busy
{
     // 1. check status 
   if(TTS_Var.Playing)
   	{
           memset(TTS_Var.HEX_BUF,0,sizeof((const char*)TTS_Var.HEX_BUF));
          TTS_Var.HEX_len=LEN;
	    memcpy(TTS_Var.HEX_BUF,Instr,LEN);		
           TTS_Var.Save=1;  
	    rt_kprintf("\r\n   播报中,来信息存储\r\n"); 	   
   	    return  TTS_BUSY;
   	}  	
    //  2.   HEX to  ASCII convert 
     memset(TTS_Var.ASCII_BUF,0,sizeof((const char*)TTS_Var.ASCII_BUF));
     TTS_Var.ASCII_Len=GSM_HextoAscii_Convert(Instr,LEN,TTS_Var.ASCII_BUF);
     TTS_Var.ASCII_Len=(LEN<<1);// 长度乘以 2	 
     //  3. cacu  timeout value
     TTS_Var.TimeOut_limt=LEN/3+3;  // 3个字每秒+ 3  秒保护时间
     TTS_Var.TimeCounter=0;
     //  4.  ready to play
	TTS_Var.NeedtoPlay=1;	 
    return  TTS_OK;
}
u8    TTS_Data_Play(void) 
{
       u16   i=0;
	//  1.  check status  
      if(TTS_Var.Playing)
              return  TTS_BUSY;
      else
	if(TTS_Var.Save)  //  2.  check  save  status
	{      
	      TTS_Var.Save=0;
	     //  3. HEX to  ASCII	  
	     memset(TTS_Var.ASCII_BUF,0,sizeof((const char*)TTS_Var.ASCII_BUF));
	     TTS_Var.ASCII_Len=GSM_HextoAscii_Convert(TTS_Var.HEX_BUF,TTS_Var.HEX_len,TTS_Var.ASCII_BUF);
           TTS_Var.ASCII_Len=(TTS_Var.HEX_len<<1);// 长度乘以 2	 
	     //  4. cacu  timeout value
	     TTS_Var.TimeOut_limt=TTS_Var.HEX_len/3+3;  // 3个字每秒+ 3  秒保护时间
	     TTS_Var.TimeCounter=0;
	     //  5.  ready to play
		TTS_Var.NeedtoPlay=1;        
	}
       	
      //   6.   play process
      if( TTS_Var.NeedtoPlay	==1)
      	{
      	  Speak_ON;   // 开功放
      	   TTS_Var.Playing=1;
           //  head
           memset(AT_TTS,0,sizeof(AT_TTS));  
	    strcat(AT_TTS,"AT%TTS=2,3,6,\""); 
	    TTS_Len=strlen(AT_TTS)	;	      
	   //  info		 
	     memcpy(AT_TTS+TTS_Len,TTS_Var.ASCII_BUF,TTS_Var.ASCII_Len);	
	     TTS_Len+=TTS_Var.ASCII_Len; 
	   //  tail	 
	      memcpy((char*)AT_TTS+TTS_Len,"\"\r\n",3);    // tail 	 
            TTS_Len+=3;     	 
	        
	    for(i=0;i<TTS_Len;i++)
			 rt_kprintf("%c",AT_TTS[i]);   

	   rt_hw_gsm_output_Data(AT_TTS,TTS_Len);	

