nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
	  WatchDog_Feed();
         delay_ms(30); // rt_thread_delay(RT_TICK_PER_SECOND/8);	
 
           //---------------------
           TTS_Var.NeedtoPlay=0; 
      	}
	  return TTS_OK;
}

void   TTS_Play_End(void)
{
             TTS_Var.Playing=0;
	      TTS_Var.TimeCounter=0;
		 
	   Speak_OFF;	   // 关闭功放
}

void TTS_Exception_TimeLimt(void)     //  单位: s 
{    //  TTS  播报异常 超时计数器
      if(TTS_Var.Playing)
      	{
	         TTS_Var.TimeCounter++;
		  if(TTS_Var.TimeCounter>TTS_Var.TimeOut_limt)
		  	{
		           TTS_Var.Playing=0;
		           TTS_Var.TimeCounter=0;
		  	}
      	}
}

u8  TTS_ACK_Error_Process(void)
{   // 发送TTS  语音播报命令后返回Error 异常
      if(TTS_Var.Playing)
        {      
	           TTS_Var.Playing=0;
	           TTS_Var.TimeCounter=0; 
		     return true;	   
	 }	
      else
	  	   return false;
}

void TTS_play(u8 * instr)
{
      WatchDog_Feed();
      TTS_Get_Data(instr,strlen(instr));
      rt_kprintf("\r\n    手动语音播报: %s\r\n",instr);
}
FINSH_FUNCTION_EXPORT(TTS_play, TTS play);


void GSM_CSQ_timeout(void)
{
            CSQ_counter++;
          if(CSQ_counter>=CSQ_Duration)
          {
              CSQ_counter=0;  
              CSQ_flag=1;    
          }	 

}

void GSM_CSQ_Query(void)
{    
    	    if((CSQ_flag==1)&&(MediaObj.Media_transmittingFlag==0)&&(GSM_PWR.GSM_power_over)&&(stopNormal==0))  
	   { 
		  CSQ_flag=0; 
		  rt_hw_gsm_output("AT+CSQ\r\n");    //检查信号强度
		    if(DispContent)	
		        rt_kprintf("AT+CSQ\r\n");  
	   } 	
}




//-------------------------------------------------------------------------------
void  DataLink_MainSocket_set(u8 *IP, u16  PORT, u8 DebugOUT)
{
	  memset((char *)DialStr_Link1+20,0,sizeof(DialStr_Link1)-20);
	  IP_Str((char *)DialStr_Link1+20, *( u32 * ) IP);		 

         strcat((char *) DialStr_Link1,"\"," );
	  sprintf((char*)DialStr_Link1+strlen((char const*)DialStr_Link1), "%u\r\n", PORT);	

	     if(DebugOUT)
	     	{
		  rt_kprintf("		   Main Initial  Str:");  
		  rt_kprintf((char*)DialStr_Link1);
	     	}  
}

void  DataLink_AuxSocket_set(u8 *IP, u16  PORT,u8 DebugOUT) 
{
  

	  memset((char *)DialStr_LinkAux+20,0,sizeof(DialStr_LinkAux)-20);
	  IP_Str((char *)DialStr_LinkAux+20, *( u32 * ) IP);   	  
	   
	  strcat((char *) DialStr_LinkAux,"\"," );
	  sprintf((char*)DialStr_LinkAux+strlen((char const*)DialStr_LinkAux), "%u\r\n", PORT); 

         if(DebugOUT)
	 {
	   rt_kprintf("\r\n  辅IP   DialString : "); 
	   rt_kprintf((char*)DialStr_LinkAux);          
	 } 
}

void  DataLink_IC_Socket_set(u8 *IP, u16  PORT,u8 DebugOUT) 
{

   	  memset((char *)DialStr_IC_card+20,0,sizeof(DialStr_IC_card)-20);
	  IP_Str((char *)DialStr_IC_card+20, *( u32 * ) IP);   	  
	   
	  strcat((char *) DialStr_IC_card,"\"," );
	  sprintf((char*)DialStr_IC_card+strlen((char const*)DialStr_IC_card), "%u\r\n", PORT); 

         if(DebugOUT)
	 {
	     rt_kprintf("\r\n IC  DialString : "); 
	     rt_kprintf((char*)DialStr_IC_card);         
	 } 	 
		 
}

void  DataLink_APN_Set(u8* apn_str,u8 DebugOUT)
{
         memset(Dialinit_APN+APN_initSTR_LEN,0,sizeof(Dialinit_APN)-APN_initSTR_LEN);
	  memcpy(Dialinit_APN+APN_initSTR_LEN,apn_str,strlen((char const*)apn_str));
	  strcat( (char *)Dialinit_APN,"\"\r\n" );

	  if(DebugOUT)
	  {
	     rt_kprintf("\r\n APN 设置 :  ");    
	     rt_kprintf((const char*)Dialinit_APN);      
	 }
}


void  DataLink_DNSR_Set(u8* Dns_str,u8 DebugOUT)
{
         memset(Dialinit_DNSR+9,0,sizeof(Dialinit_DNSR)-9); 
	  memcpy(Dialinit_DNSR+9,Dns_str,strlen((char const*)Dns_str)); 
	  strcat( Dialinit_DNSR,"\"\r\n" );  
	  	
	if(DebugOUT)
	{
		  rt_kprintf("\r\n		 域名1 设置 :	 "); 
		  rt_kprintf(Dialinit_DNSR); 
	}

}

void  DataLink_DNSR2_Set(u8* Dns_str,u8 DebugOUT)
{
         memset(Dialinit_DNSR2+9,0,sizeof(Dialinit_DNSR2)-9); 
	  memcpy(Dialinit_DNSR2+9,Dns_str,strlen((char const*)Dns_str)); 
	  strcat( Dialinit_DNSR2,"\"\r\n" ); 
	  	
	if(DebugOUT)
	{
		  rt_kprintf("\r\n		Aux  域名设置 :	 "); 
		  rt_kprintf(Dialinit_DNSR2); 
	}

}

 void Gsm_RegisterInit(void)
{  
     //--------   Power  Related   ---------
     GSM_PWR.GSM_PowerEnable=1;  // 开始使能
     GSM_PWR.GSM_powerCounter=0;
     GSM_PWR.GSM_power_over=0;  

    // --------  IMSI  -------------------
    memset((u8*)&IMSIGet,0,sizeof(IMSIGet));       

    //---------- COMM AT ----------------
    memset((u8*)&CommAT,0,sizeof(CommAT)); 
   

   //----------- Data Dial ----------------
     memset((u8*)&DataDial,0,sizeof(DataDial)); 
     DataDial.start_dial_stateFLAG=1; //important 

	  //---  Network Setting  Default ----
	  DataLink_APN_Set(APN_String,1);   // apn 
	  DataLink_DNSR_Set(DomainNameStr,0);    // DNSR  MG323  没有 
	  DataLink_DNSR2_Set(DomainNameStr_aux,0);  
	  DataLink_MainSocket_set(RemoteIP_main, RemotePort_main,1); 
	  DataLink_AuxSocket_set(RemoteIP_aux, RemotePort_aux,1);

 
  #if 0
   GsmRxBuf_Wr=0;
   GsmRxBuf_Rd=0;
  
   GSM_rx_Wr=-1;
  
   GsmTxLen=0;
   GsmTxIndex=0;
   pGsmTx=NULL;
   GsmTxActive=OS_FALSE;
  
  
  //------- GPPRS 功能相关 ----------------
  GSM_PWR.GSM_powerCounter=0;
  quick_flag=0;
  GSM_PWR.GSM_power_over=0;  
  Datalink_close=0;	//挂断后不再登陆
  
  //-------  蜂鸣器状体 ------------------------
  buz_on_Flag=0;
  buz_on_Counter=0;  
  
  DataLink_Online=0;    // GPRS 在线标志
  
  EM310_StartFLAG=0;// EM310 模块开启标志位
  COPS_Couter=0;    // COPS  返回次数
  
  CSQ_counter=0;
  CSQ_Duration=32;	//查询CSQ 的定时间隔
  CSQ_flag=1;
  ModuleSQ=0;       //GSM 模块信号强度数值
  ModuleStatus=0;   //网络状态  
  
  
  
  
  //-----  1 s timer  related below   ------
  one_second_couner=0;
  Enable_UDP_sdFlag=0;
  Timercounter=0;
    
  //------ WatchDog --
   WatchDog_Feed();  //  Task Idle Hook 相关
      
  //-----  AT -----------
  memset(&AT,0,sizeof(AT));
  info_len=0;
  DataLink_EndFlag=0;  
  DataLink_end_counter=0;
  DataConnect_counter=0;		 //  在没有登网前重拨次数限制计数器    11-3-4 补加的 ERROR 20 
     
    
  //----- UDP ------------
  UDP_sdFlag=0;		  //定时发送GPS位置信息标志
  UDP_sdDuration=10; 
  UDP_Connect=0; 	  
#endif
}

