nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
}

void End_Datalink(void)
{
       if(1==DataLink_EndFlag)          
	{
	   TCP2_Connect=0;
	   DataLink_Online=disable;  // off line

	  DataLink_EndCounter++;
	  if(DataLink_EndCounter==2) 
	  { 	rt_kprintf(" Ready to escape gprs \r\n");	 
		rt_hw_gsm_output(CutDataLnk_str2);
		rt_kprintf(CutDataLnk_str2);
		DataDial.Dial_step_Retry=0;
		DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
	  }
	  else
	  if(DataLink_EndCounter==3)
	  { 		
		rt_hw_gsm_output(CutDataLnk_str3);	// 关闭掉Internet
	       rt_kprintf(CutDataLnk_str3);	// 关闭掉Internet
	       DataDial.Dial_step_Retry=0;
		DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;

	  }    
	  else
	  if(DataLink_EndCounter==5)
	  { 		
		rt_hw_gsm_output(CutDataLnk_str4);	 
		rt_kprintf(CutDataLnk_str4);	 
		DataDial.Dial_step_Retry=0;
		DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
	  }
	    if(DataLink_EndCounter==8)
	  { 		
		rt_hw_gsm_output(CutDataLnk_str5);	 
		rt_kprintf(CutDataLnk_str5);   
		DataDial.Dial_step_Retry=0;
		DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
	  }
	  else
	  if(DataLink_EndCounter>10)   
	  {
		DataLink_EndCounter=0; 
		DataLink_EndFlag=0;
		//-----------------------------
	     if(JT808Conf_struct.Close_CommunicateFlag==0)
	     	{
	     	 if(Stop_Dial==0)
	     	 	{
		               CommAT.Initial_step=0;  
				 CommAT.Total_initial=0;  
		               Redial_Init(); 
				 ModuleStatus &=~Status_GPRS;
			        rt_kprintf(" Redial Start\r\n");   
	     	 	}
			  else
			  	 rt_kprintf("\r\n 注销状态 ，不重拨\r\n");   
	     	}
		else
			rt_kprintf("\r\n 关闭通信状态 ，不重拨\r\n");   
		      //-----------------------------
	  }
    }     

}

void  ISP_Timer(void)
{
            //--------- Timer  ------------- 
   if((TCP2_ready_dial==1)&&DataLink_Status())     
       {
                 Ready_dial_counter2++;  
		   if(Ready_dial_counter2>5)  
                	{
                         Ready_dial_counter2=0;
			    //DataDial.Dial_step=Dial_ISP;    
			    DataDial.Dial_ON=enable;  //
				
                         Dial_Stage(Dial_ISP);
		       }  
       } 

                  //---------   ISP 心跳包发送 - ----
      /*        if(TCP2_Connect==1)
             {
                   TCP2_Coutner++;
                    if(TCP2_Coutner>=TCP2_sdDuration)
                    	{
                           TCP2_Coutner=0; 
			      TCP2_IC_sdFlag=1;     
                    	}

             }	
      */

}
 
u8  GPRS_GSM_PowerON(void)
{	
	/*
              EM310开关机流程
              powerkey 拉低 50ms 开机  然后再拉低50ms关机
	*/
      if(GSM_PWR.GSM_power_over) 
			  return 1;
	
         GSM_PWR.GSM_powerCounter+=50;   
		 #if 0
     			if((GSM_PWR.GSM_powerCounter>=10)&&(GSM_PWR.GSM_powerCounter<500))
			 {
			    GPIO_ResetBits(GPIOD,GPRS_GSM_Power);    //  关电
			    GPIO_SetBits(GPIOD,GPRS_GSM_PWKEY);    //  PWK 低 
			    rt_kprintf(" step 1\r\n");   
			 }	
			 if((GSM_PWR.GSM_powerCounter>=500)&&(GSM_PWR.GSM_powerCounter<600))
			 {	GPIO_SetBits(GPIOD, GPIO_Pin_10);   // Gps module Power on   GPS 模块开电   


			        GPIO_SetBits(GPIOD,GPRS_GSM_Power);    //  开电
			        GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY);    //  PWK 高  
				  rt_kprintf(" step 2\r\n");   
			 }			
			 if(GSM_PWR.GSM_powerCounter>=1000)            
			 {   
				rt_kprintf("         %s","--GPRS Power over\r\n ");        
				GSM_PWR.GSM_PowerEnable=0; 
				GSM_PWR.GSM_powerCounter=0;
				GSM_PWR.GSM_power_over=1;   
				//GPIO_SetBits(GPIOD, GPIO_Pin_10);   // Gps module Power on   GPS 模块开电   
				   //-------add for reg  
			 }	 
           
          #endif
	
               	if((GSM_PWR.GSM_powerCounter>=10)&&(GSM_PWR.GSM_powerCounter<300))
			 {
			    GPIO_ResetBits(GPIOD,GPRS_GSM_Power);    // 关电
			    GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY);      //  PWK 低 
			    rt_kprintf(" step 1\r\n");   
			 }	
			 if((GSM_PWR.GSM_powerCounter>=300)&&(GSM_PWR.GSM_powerCounter<400))
			 {
			        GPIO_SetBits(GPIOD,GPRS_GSM_Power);    //  开电
			        GPIO_SetBits(GPIOD,GPRS_GSM_PWKEY);   //  PWK低
				  rt_kprintf(" step 2\r\n");   
				  gps_onoff(1);  // Gps module Power on   GPS 模块开电   
			 }	
			 if((GSM_PWR.GSM_powerCounter>=400)&&(GSM_PWR.GSM_powerCounter<700)) 
			 {
			   GPIO_SetBits(GPIOD,GPRS_GSM_Power);    //  开电
			   GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY);    //  PWK 高
			    rt_kprintf(" step 3\r\n");   
			 }	
			 if((GSM_PWR.GSM_powerCounter>=700)&&(GSM_PWR.GSM_powerCounter<900))   
			 {
				GPIO_SetBits(GPIOD,GPRS_GSM_PWKEY);   //  PWK低
				 rt_kprintf(" step 4\r\n");    
			 }	 
			 if((GSM_PWR.GSM_powerCounter>=900)&&(GSM_PWR.GSM_powerCounter<1000))      
			 {
			    GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY);      //  PWK 高   
				 rt_kprintf(" step 5\r\n");    
			 }	
			 if(GSM_PWR.GSM_powerCounter>=1000)        
			 {
				rt_kprintf("         %s","--GPRS Power over\r\n ");     
				GSM_PWR.GSM_PowerEnable=0; 
				GSM_PWR.GSM_powerCounter=0;
				GSM_PWR.GSM_power_over=1;  
				   //-------add for re g 
			 }	   
        
		 
		 #if 0
			if((GSM_PWR.GSM_powerCounter>=10)&&(GSM_PWR.GSM_powerCounter<300))
			 {
			    GPIO_ResetBits(GPIOD,GPRS_GSM_Power);    // 关电
			    GPIO_SetBits(GPIOD,GPRS_GSM_PWKEY);      //  PWK 低
			    rt_kprintf(" step 1\r\n");   
			 }	
			 if((GSM_PWR.GSM_powerCounter>=300)&&(GSM_PWR.GSM_powerCounter<400))
			 {
			        GPIO_SetBits(GPIOD,GPRS_GSM_Power);    //  开电
			        GPIO_SetBits(GPIOD,GPRS_GSM_PWKEY);   //  PWK低
				  rt_kprintf(" step 2\r\n");   
				   GPIO_SetBits(GPIOD, GPIO_Pin_10);   // Gps module Power on   GPS 模块开电   
			 }	
			 if((GSM_PWR.GSM_powerCounter>=400)&&(GSM_PWR.GSM_powerCounter<700)) 
			 {
			   GPIO_SetBits(GPIOD,GPRS_GSM_Power);    //  开电
			   GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY);    //  PWK 高
			    rt_kprintf(" step 3\r\n");   
			 }	
			 if((GSM_PWR.GSM_powerCounter>=700)&&(GSM_PWR.GSM_powerCounter<750))   
			 {
				GPIO_SetBits(GPIOD,GPRS_GSM_PWKEY);   //  PWK低
				 rt_kprintf(" step 4\r\n");   
			 }	 
			 if((GSM_PWR.GSM_powerCounter>=760)&&(GSM_PWR.GSM_powerCounter<900))      
			 {
			    GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY);      //  PWK 高 
				 rt_kprintf(" step 5\r\n");    
			 }	
			 if(GSM_PWR.GSM_powerCounter>=900)     
			 {
				rt_kprintf("         %s","--GPRS Power over\r\n ");     
				GSM_PWR.GSM_PowerEnable=0; 
				GSM_PWR.GSM_powerCounter=0;
				GSM_PWR.GSM_power_over=1;  
				   //-------add for re g 
			 }	 
		#endif
		
	 return   0;	    
}

void GSM_Module_TotalInitial(void)
{
    
