nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
       }  



}

static void GSM_Process(u8 *instr, u16 len)
{
      	u8	ok = false;
		u8	error = false;
		u8	failed = false; 
		u8	connect = false;   		
        
        u16  i=0,j=0,q=0;//,len=0;//j=0;        
        u8 reg_str[80]; 
//----------------------  Debug -------------------------		
  // if(DispContent==2)	 
   memset(GSM_rx,0,sizeof((const char*)GSM_rx));
   memcpy(GSM_rx,instr,len);
  // if((ISP_running_state==0)&&(VocREC.Sate!=VOICEREC_DataRXing)) 
  if(BD_ISP.ISP_running==0)
   {
      // rt_kprintf("\r\n");      
        for(i=0;i<len;i++)  
		 rt_kprintf("%c",GSM_rx[i]);     	
   }

   //------------------------------------------------------------------------------------------------------------------- 
     /*if (strncmp((char*)GSM_rx, "AT-Command Interpreter ready",20) == 0)  
	{	
		GSM_PWR.GSM_PowerEnable=0;      
		GSM_PWR.GSM_powerCounter=0;
		GSM_PWR.GSM_power_over=1;   
		rt_kprintf("\r\n  GSM 模块启动\r\n");         			
	}*/

      //----------------判断短信状态------------------------	
   /*      if((SMS_send.Msg_sdState==1)&&(SMS_send.Msg_step==2))
         	{
                   if(GSM_rx[0]=='>')
                   	{  
                   	      SMS_send.Msg_step=3;
			      memset(GSM_rx, 0, sizeof(GSM_rx));
	                    GSM_rx_Wr = 0; 			  
			      return ;		  
                   	}
         	}
       */  	
      //-------------  判断短信发送完毕  ---------------
       if(strncmp((char*)GSM_rx,"+CMGS:",6)==0)  
       {
                 SMS_send_end();
		    rt_kprintf(" \r\n   SMS send  OK!\r\n");				 
       }        
      //--------------------------------------------------------
	 if(strncmp((char*)GSM_rx,"%RECDATA:",9)==0)  //%RECDATA:18,"0C49CA45E3F24DF500BE1   x28
      	{                                                                            //%RECDATA:2,"0C341
      	   //   rt_kprintf("\r\n  RECFGET len=%d\r\n",len);
      	      WatchDog_Feed();  
      	      memcpy(VocREC.ASCII_in,GSM_rx,len); 
             VOC_REC_dataGet(VocREC.ASCII_in);    
	      goto RXOVER; 	 		
      	} 
         if(strncmp((char*)GSM_rx,"%RECSTOP:",9)==0)    //%RECSTOP: 10,7000 
         {
             WatchDog_Feed();
             rt_kprintf("\r\n 接收 录音结束\r\n");         	
	      if(VocREC.Sate==VOICEREC_DataRXing) 	    // 如果处于数据接收态则处理否则不处理
                   VOC_REC_Stop(GSM_rx);    
		WatchDog_Feed();	 
	      goto RXOVER; 
         }
       if(strncmp((char*)GSM_rx, "%IPDATA:2",9)==0)   // ISP 过来      
	{												   //exam:	%IPDATA:2,16,"6473616466617365"
              for(i=0;i<20;i++)   //  从前20个字节中找第一个"
		{
			if(GSM_rx[i]=='"')
				break;
		} 
		  info_len=(len-i-5);	 
		    rt_kprintf("\r\n infolen=%d  len=%d  i=%d\r\n",info_len,len,i);      
	        // Get_GSM_HexData(GSM_rx+i+1,info_len,1);      //  远程下载链路
	        //------------------------------------------------
	         UDP_hexRx_len= GSM_AsciitoHEX_Convert(GSM_rx+i+1,info_len,UDP_HEX_Rx); 
	         TCP_RX_Process(1);    
		//--------------------------------------------------	 
	         goto RXOVER; 
	 }	
	else    
	if(strncmp((char*)GSM_rx, "%IPDATA:1",9)==0) // UDP	  有数据过来了
	{												   //exam:	%IPDATA:1,16,"6473616466617365"
               for(i=0;i<20;i++)   //  从前20个字节中找第一个"
			{
				if(GSM_rx[i]=='"')
					break;
			} 
		  info_len=len-i-5;  	  
		//  rt_kprintf("\r\n  IPDATA 1 len=%d\r\n",info_len);   
		  WatchDog_Feed();
	         Get_GSM_HexData(GSM_rx+i+1,info_len,0);       
	         goto RXOVER; 	 
	 }     
	if(strncmp((char*)GSM_rx, "%TTS: 0",7)==0)
	{
                 TTS_Play_End();
		    rt_kprintf("\r\n   TTS  播放完毕\r\n");    		 
	}
#ifdef  SMS_ENABLE
		//--------		SMS  service  related Start  -------------------------------------------
		//+CMTI: "SM",1 		   +CMTI: "SM",1
		if( strncmp( (char*)GSM_rx, "+CMTI: \"SM\",", 12 ) == 0 )
		{
			rt_kprintf( "\r\n收到短信:" );
			j = sscanf( GSM_rx + 12, "%d", &i );
			if( j )
			{
				SMS_Rx_Notice(i);	
			}
		}
		else if( strncmp( (char*)GSM_rx, "+CMT: ", 6 ) == 0 )
		{
			if(GSM_rx[6]==',')		///PDU模式
			{
				if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )	//等待1000ms,实际上就是变长的延时,最长1000ms
				{
					memset( GSM_rx, 0, sizeof( GSM_rx ) );
					memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
					len=GSM_RX_BUFF.gsm_wr;
	
					SMS_Rx_PDU(GSM_rx,len); 
				}
			}
			else					///TEXT模式
			{
				j	= 0;
				q	= 0;
				memset( reg_str, 0, sizeof( reg_str ) );
				for( i = 6; i < len; i++ )
				{
					if( ( j == 1 ) && ( GSM_rx[i] != '"' ) )
					{
						reg_str[q++] = GSM_rx[i];
					}
					if( GSM_rx[i] == '"' )
					{
						j++;
						if(j>1)
							break;
					}
				}
				//rt_kprintf( "\r\n  短息来源号码:%s \r\n", reg_str );
				if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )	//等待1000ms,实际上就是变长的延时,最长1000ms
				{
					memset( GSM_rx, 0, sizeof( GSM_rx ) );
					memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
					len=GSM_RX_BUFF.gsm_wr;
					SMS_Rx_Text(GSM_rx,reg_str);
				}
			}
			
		}
#ifdef SMS_TYPE_PDU
		else if( strncmp( (char*)GSM_rx, "+CMGR:", 6 ) == 0 )
		{
			if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )	//等待1000ms,实际上就是变长的延时,最长1000ms
			{
				memset( GSM_rx, 0, sizeof( GSM_rx ) );
				memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
				len=GSM_RX_BUFF.gsm_wr;
	
				SMS_Rx_PDU(GSM_rx,len);
			}
		}
#else
		else if( strncmp( (char*)GSM_rx, "+CMGR:", 6 ) == 0 )
		{
			//+CMGR: "REC UNREAD","8613602069191", ,"13/05/16,13:05:29+35"
			// 获取要返回短息的目的号码
			j	= 0;
			q	= 0;
			memset( reg_str, 0, sizeof( reg_str ) );
			for( i = 6; i < 50; i++ )
			{
				if( ( j == 3 ) && ( GSM_rx[i] != '"' ) )
				{
					reg_str[q++] = GSM_rx[i];
				}
				if( GSM_rx[i] == '"' )
				{
					j++;
				}
			}
			//rt_kprintf( "\r\n  短息来源号码:%s \r\n", reg_str );
			if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )	//等待1000ms,实际上就是变长的延时,最长1000ms
			{
				memset( GSM_rx, 0, sizeof( GSM_rx ) );
				memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
				len=GSM_RX_BUFF.gsm_wr;
				SMS_Rx_Text(GSM_rx,reg_str);			
			}
		}
#endif
	
#endif


	
	if(strncmp((char*)GSM_rx, "%IPSENDX:1",10)==0)	 // 链路 1  TCP 发送OK  
	{												   //exam:	%IPSENDX:1,15 
             Api_cycle_Update();  //  数据发送 ，更新写指针	  
             
