nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
	//---------------------  Function  Process Below --------------------------
	if ((DataDial.Dial_step != Dial_MainLnk) && failed) 
	{ 
		 Dial_Stage(Dial_Idle); 
		return;
	}
	
	switch (DataDial.Dial_step)
	{
		case Dial_DialInit0:	if (ok)  Dial_Stage(Dial_DialInit1);
								break;
		case Dial_DialInit1   :   if (ok) Dial_Stage(Dial_DialInit2); 
								break;
		case Dial_DialInit2	:	if (ok)   Dial_Stage(Dial_DialInit3);
								break;
		case Dial_DialInit3	:	if (ok)   Dial_Stage(Dial_DialInit4);
								break;
		case Dial_DialInit4	:	if (ok)  Dial_Stage(Dial_DialInit5);
								break;
		case Dial_DialInit5	:	if (ok)  Dial_Stage(Dial_DialInit6);
								break;
		case Dial_DialInit6	:	if (ok)  
			                                 /*     IC 卡过检验不需要DNSR
			                                   #ifdef MULTI_LINK
			                                         Dial_Stage(Dial_DNSR1);   // 多连接
								#else
							    */	
						           // Dial_Stage(Dial_MainLnk);   
						           Dial_Stage(Dial_DNSR1); 
		                                      // #endif
								break;						
		case Dial_DNSR1	:	if (ok)
			                           {
                                                         Dial_Stage(Dial_DNSR2);
			                           }   
								break;		
	         case Dial_DNSR2	:	if (ok)
			                           {
                                                          Dial_Stage(Dial_MainLnk); 
			                           }   
								break;							
		case Dial_MainLnk		:		
	      	case Dial_AuxLnk	       :	if (failed || error)
								{
									DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;				// try again in 6 seconds
									break;
								} 
								 if (connect) 						
								{   //  below  run once  since  online
								     if(DataDial.Dial_step ==Dial_MainLnk)    //mainlink 
								             rt_kprintf("\r\n连接成功TCP---\r\n");
								     if(DataDial.Dial_step ==Dial_AuxLnk)    //auxlink 	 
								                rt_kprintf("\r\n Aux 连接成功TCP---\r\n");

								 
								            //   注册状态  且 不是休眠状态
								            if((1==JT808Conf_struct.Regsiter_Status)&&(SleepState==0))  
								                {  
								                   DEV_Login.Operate_enable=1;   	
                                                                           DEV_Login.Enable_sd=1;//鉴权只发一次
                                                                           DEV_Login.Sd_counter=0;
                                                                           DEV_Login.Max_sd_num=0; 
								            	}
								   // connect = true;
								         //  -----  Data  Dial Related ------
									    if((DataDial.Dial_ON)&&(DataDial.Dial_step<Max_DIALSTEP)) 
									    	{
							                            Dial_Stage(Dial_Idle);
										       DataDial.Dial_step_Retry=0;
										       DataDial.Dial_step_RetryTimer=0;  			
									    	}
							              //-----------------------------------
							           //   DataDial.Dial_ON=0; 
								       DataLink_Online=2; 	  
									DialLink_TimeOut_Clear(); 	  

									 Dial_Stage(Dial_Idle); //  state  convert   
									 RTC_TimeShow();	
						             }						           
							      //------------------------------------------							
								 break;  
		     case Dial_ISP:
			 	                           if (failed || error)
								{
									DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
									break;
								}
								 if (connect) 
								{
									 Dial_Stage(Dial_Idle); //	In EM310 Mode										
									 TCP2_Connect=1;		
									 //TCP2_IC_sdFlag=1;
									  TCP2_ready_dial=0;  
									 rt_kprintf("\r\n //---------------------------------");
									 rt_kprintf("\r\n     IC 卡TCP 连接成功!\r\n");     
									  rt_kprintf("//---------------------------------\r\n "); 
									  DataDial.Dial_ON=0;  // 
									  BD_ISP.ISP_running=0;
								}							 
								break;		 						
		default 			:	 Dial_Stage(Dial_Idle);
	                                          DataDial.Dial_step_Retry=0;	
								break;
	}
    //-----------
}

void  IMSIcode_Get(void)
{

              if((GSM_PWR.GSM_power_over==1) &&(JT808Conf_struct.password_flag ==1) )
		{
                   IMSIGet.Checkcounter++;
		       if(IMSIGet.Checkcounter>30)     //  15*30=450ms      
		   	{
                          IMSIGet.Checkcounter=0; 
			    if(IMSIGet.Get_state==1)
	               {
	                 rt_hw_gsm_output(IMSI_Check_str);    // 查询 IMSI_CODE 号码 
	                 rt_kprintf(IMSI_Check_str);  
		         }  
			  else 
			   {
			  	   rt_hw_gsm_output(SIM_Check_Str);    // 先检查 SIM 卡的存在
		                 rt_kprintf(SIM_Check_Str);    
			   }
		   	} 
		}  
}

void on_spk(void)
{
    Speak_ON;   // 开功放
}
FINSH_FUNCTION_EXPORT(on_spk, Speaker On);
 
void off_spk(void)
{
    Speak_OFF;   // 开功放
}
FINSH_FUNCTION_EXPORT(off_spk, Speaker Off); 

void AT(u8 *str)
{
       rt_hw_gsm_output((const char*)str);     
} 
FINSH_FUNCTION_EXPORT(AT, gsm_ATcmd);

void  redial(void)
{
      DataLink_EndFlag=1; //AT_End();   
        rt_kprintf("\r\n Redial\r\n");      
}
FINSH_FUNCTION_EXPORT(redial, redial);


void Rx_in(u8* instr)
{
    u16  inlen=0;

      if(strncmp(instr,"can1",4)==0)
      	{
           Get_GSM_HexData("7E8103003B013601300001864F060000010004000001F40000010102000A0000010204000000000000010302000000000110080000000058FFD11700000111080000006458FFD017EA7E",148,0);
           OutPrint_HEX("模拟1", GSM_HEX, GSM_HEX_len); 

	 }
        else
      	{
		     inlen=strlen((const char*)instr);
		     Get_GSM_HexData(instr,inlen,0);  
		      OutPrint_HEX("模拟", GSM_HEX, GSM_HEX_len); 
      	}	 

}
FINSH_FUNCTION_EXPORT(Rx_in, Rx_in);

void canrxid(u8 * instr)
{
       u8  REG[4];
      
	GSM_AsciitoHEX_Convert(instr,8,REG); 
       CAN_trans.canid_1_Filter_ID=((REG[0]&0x1F)<<24)+(REG[1]<<16)+(REG[2]<<8) +REG[3]; 
       rt_kprintf("\r\n  Set Filter  ID =%08X\r\n", CAN_trans.canid_1_Filter_ID);        
}
FINSH_FUNCTION_EXPORT(canrxid, canrxid);


